In [1]:
import pandas as pd

## 예제 6-12 그룹화 처리 후 파일 저장

In [2]:
asia = pd.read_csv('../data/dataset_raw_data.csv',encoding="cp949")

In [3]:
asia.shape

(95012, 12)

In [4]:
asia.columns

Index(['노선명', '항공사', '출발 공항', '출발 국가', '도착 공항', '도착 국가', '기체번호', '기종',
       '정원(전체)', '년도', '월', '일'],
      dtype='object')

In [5]:
asia.head()

,노선명,항공사,출발 공항,출발 국가,도착 공항,도착 국가,기체번호,기종,정원(전체),년도,월,일
0,7J105,Tajik Air,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2018,1,7
1,7J105,Tajik Air,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2018,1,14
2,7J105,Tajik Air,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2018,1,21
3,7J105,Tajik Air,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2018,1,29
4,7J105,Tajik Air,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2018,2,4

In [32]:
asia.tail()

,노선명,항공사,출발 공항,출발 국가,도착 공항,도착 국가,기체번호,기종,정원(전체),년도,월,일
95007,ZM809,Air Manas,FRU,KGZ,KHG,CHN,EX-37801,B737-82R,189,2016,12,16
95008,ZM809,Air Manas,FRU,KGZ,KHG,CHN,EX-37801,B737-82R,189,2016,12,19
95009,ZM809,Air Manas,FRU,KGZ,KHG,CHN,EX-37801,B737-82R,189,2016,12,23
95010,ZM809,Air Manas,FRU,KGZ,KHG,CHN,EX-37801,B737-82R,189,2016,12,26
95011,ZM809,Air Manas,FRU,KGZ,KHG,CHN,EX-37801,B737-82R,189,2016,12,30

In [33]:
asia.count()

노선명       95012
항공사       95012
출발 공항     95012
출발 국가     95012
도착 공항     95012
도착 국가     95012
기체번호      95012
기종        95012
정원(전체)    95012
년도        95012
월         95012
일         95012
dtype: int64

In [8]:
asia.get_dtype_counts()

int64     4
object    8
dtype: int64

In [38]:
asia_dep_port = asia.groupby(["항공사","출발 공항","출발 국가","도착 공항","도착 국가","년도","월"])

In [39]:
type(asia_dep_port)

pandas.core.groupby.DataFrameGroupBy

In [40]:
a = asia_dep_port.agg({'월':'count',
                       '년도':'count',
                       '출발 국가':'count',
                       '도착 국가':'count',
                       '정원(전체)':'sum'})

In [41]:
a.head()

                                                           월  년도  출발 국가  \
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6    8   8      8
                                                      7    7   7      7
                                                      8   12  12     12
                                                      9    2   2      2
                                                      11   2   2      2

                                                          도착 국가  정원(전체)
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6       8     500
                                                      7       7     514
                                                      8      12     760
                                                      9       2     164
                                                      11      2     140

In [42]:
a.tail()

                                          월  년도  출발 국가  도착 국가  정원(전체)
항공사      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
flydubai TSE   KAZ   DXB   UAE   2018 1  18  18     18     18    3132
                                      2  16  16     16     16    2784
                                      3  29  29     29     29    5076
                                      4  17  17     17     17    2958
                                      5  17  17     17     17    2958

In [44]:
a.index.get_level_values(0)

Index(['AZAL Azerbaijan Airlines', 'AZAL Azerbaijan Airlines',
       'AZAL Azerbaijan Airlines', 'AZAL Azerbaijan Airlines',
       'AZAL Azerbaijan Airlines', 'AZAL Azerbaijan Airlines',
       'AZAL Azerbaijan Airlines', 'AZAL Azerbaijan Airlines',
       'AZAL Azerbaijan Airlines', 'AZAL Azerbaijan Airlines',
       ...
       'flydubai', 'flydubai', 'flydubai', 'flydubai', 'flydubai', 'flydubai',
       'flydubai', 'flydubai', 'flydubai', 'flydubai'],
      dtype='object', name='항공사', length=7769)

In [45]:
a.index.get_level_values(1)

Index(['SCO', 'SCO', 'SCO', 'SCO', 'SCO', 'SCO', 'SCO', 'SCO', 'SCO', 'SCO',
       ...
       'TSE', 'TSE', 'TSE', 'TSE', 'TSE', 'TSE', 'TSE', 'TSE', 'TSE', 'TSE'],
      dtype='object', name='출발 공항', length=7769)

In [46]:
a.columns

Index(['월', '년도', '출발 국가', '도착 국가', '정원(전체)'], dtype='object')

In [47]:
a.columns = ['운항회수', '년도', '출발 국가', '도착 국가', '정원(전체)']

In [48]:
a.head()

                                                          운항회수  년도  출발 국가  \
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6      8   8      8
                                                      7      7   7      7
                                                      8     12  12     12
                                                      9      2   2      2
                                                      11     2   2      2

                                                          도착 국가  정원(전체)
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6       8     500
                                                      7       7     514
                                                      8      12     760
                                                      9       2     164
                                                      11      2     140

In [16]:
a.drop(columns="년도",axis=1,inplace=True)

In [17]:
a.head()

                                                          운항회수  출발 국가  도착 국가  \
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6      8      8      8
                                                      7      7      7      7
                                                      8     12     12     12
                                                      9      2      2      2
                                                      11     2      2      2

                                                          정원(전체)
항공사                      출발 공항 출발 국가 도착 공항 도착 국가 년도   월
AZAL Azerbaijan Airlines SCO   KAZ   GYD   AZE   2016 6      500
                                                      7      514
                                                      8      760
                                                      9      164
                                                      11     140

In [18]:
a.to_csv("example_lee.csv",encoding='cp949')